{
  "coffees": [
    {
      "id": "ESP01",
      "name": "Single Shot",
      "price": 2.99,
      "rating": 4.5,
      "image": "../Data/images/espresso/epresso1.jpg",
      "category": "espresso"
    },
    {
      "id": "ESP02",
      "name": "Double Shot",
      "price": 3.99,
      "rating": "../Data/images/espresso/epresso2.jpg",
      "category": "espresso"
    },
    {
      "id": "ESP03",
      "name": "Ristretto",
      "price": 3.49,
      "rating": 4.2,
      "image": "../Data/images/espresso/espresso3.jpg",
      "category": "espresso"
    },
    {
      "id": "ESP04",
      "name": "Lungo",
      "price": 3.49,
      "rating": 4.4,
      "image": "../Data/images/espresso/espress04.jpg",
      "category": "espresso"
    },
    {
      "id": "ESP05",
      "name": "Americano",
      "price": 3.49,
      "rating": 4.3,
      "image": "../Data/images/espresso/espresso5.jpg",
      "category": "espresso"
    },
    {
      "id": "ESP06",
      "name": "Espresso Macchiato",
      "price": 3.99,
      "rating": 4.7,
      "image": "../Data/images/espresso/espresso6.jpg",
      "category": "espresso"
    },
    {
      "id": "BRW01",
      "name": "House Blend",
      "price": 2.99,
      "rating": 4.4,
      "image": "../Data/images/Brewed/BRW1.jpg",
      "category": "brewedCoffee"
    },
    {
      "id": "BRW02",
      "name": "Dark Roast",
      "price": 3.49,
      "rating": 4.5,
      "image": "../Data/images/Brewed/BRW2.jpg",
      "category": "brewedCoffee"
    },
    {
      "id": "BRW03",
      "name": "Light Roast",
      "price": 3.49,
      "rating": 4.2,
      "image": "../Data/images/Brewed/BRW3.jpg",
      "category": "brewedCoffee"
    },
    {
      "id": "BRW04",
      "name": "French Press",
      "price": 3.99,
      "rating": 4.8,
      "image": "../Data/images/Brewed/BRW4.jpg",
      "category": "brewedCoffee"
    },
    {
      "id": "BRW05",
      "name": "Pour Over",
      "price": 4.49,
      "rating": 4.6,
      "image": "../Data/images/Brewed/BRW5.jpg",
      "category": "brewedCoffee"
    },
    {
      "id": "BRW06",
      "name": "Cold Brew",
      "price": 4.99,
      "rating": 4.7,
      "image": "../Data/images/espresso/espresso6.jpg",
      "category": "brewedCoffee"
    },
    {
      "id": "FLV01",
      "name": "Vanilla Latte",
      "price": 4.99,
      "rating": 4.5,
      "image": "../Data/images/Flavoured/FLV1.jpg",
      "category": "flavouredCoffee"
    },
    {
      "id": "FLV02",
      "name": "Caramel Macchiato",
      "price": 5.49,
      "rating": 4.7,
      "image": "../Data/images/Flavoured/FLV2.jpg",
      "category": "flavouredCoffee"
    },
    {
      "id": "FLV03",
      "name": "Hazelnut Mocha",
      "price": 5.99,
      "rating": 4.6,
      "image": "../Data/images/Flavoured/FLV3.jpg",
      "category": "flavouredCoffee"
    },

    {
      "id": "FLV04",
      "name": "Pumpkin Spice Latte",
      "price": 5.99,
      "rating": 4.8,
      "image": "../Data/images/Flavoured/FLV4.jpg",
      "category": "flavouredCoffee"
    },
    {
      "id": "FLV05",
      "name": "Irish Cream",
      "price": 5.49,
      "rating": 4.4,
      "image": "../Data/images/Flavoured/FLV5.jpg",
      "category": "flavouredCoffee"
    },
    {
      "id": "FLV06",
      "name": "Peppermint Mocha",
      "price": 5.99,
      "rating": 4.7,
      "image": "../Data/images/Flavoured/FLV6.jpg",
      "category": "flavouredCoffee"
    },
    {
      "id": "SPC01",
      "name": "Cold Brew",
      "price": 4.99,
      "rating": 4.6,
      "image": "../Data/images/Flavoured/FLV5.jpg",
      "category": "specialityCoffee"
    },
    {
      "id": "SPC02",
      "name": "Pour Over",
      "price": 5.49,
      "rating": 4.8,
      "image": "../Data/images/Flavoured/FLV2.jpg",
      "category": "specialityCoffee"
    },
    {
      "id": "SPC03",
      "name": "Nitro Cold Brew",
      "price": 5.99,
      "rating": 4.7,
      "image": "../Data/images/espresso/espresso5.jpg",
      "category": "specialityCoffee"
    },
    {
      "id": "SPC04",
      "name": "Siphon Coffee",
      "price": 6.49,
      "rating": 4.9,
      "image": "../Data/images/Brewed/BRW3.jpg",
      "category": "specialityCoffee"
    },
    {
      "id": "SPC05",
      "name": "Espresso Con Panna",
      "price": 3.99,
      "rating": 4.5,
      "image": "../Data/images/espresso/epresso2.jpg",
      "category": "specialityCoffee"
    },
    {
      "id": "SPC06",
      "name": "Cortado",
      "price": 4.49,
      "rating": 4.6,
      "image": "../Data/images/Flavoured/FLV3.jpg",
      "category": "specialityCoffee"
    },
    {
      "id": "SNG01",
      "name": "Ethiopia Yirgacheffe",
      "price": 7.99,
      "rating": 4.8,
      "image": "../Data/images/Flavoured/FLV2.jpg",
      "category": "singleOriginCoffee"
    },
    {
      "id": "SNG02",
      "name": "Colombia Supremo",
      "price": 8.49,
      "rating": 4.7,
      "image": "../Data/images/espresso/epresso1.jpg",
      "category": "singleOriginCoffee"
    },
    {
      "id": "SNG03",
      "name": "Costa Rica Tarrazu",
      "price": 8.99,
      "rating": 4.6,
      "image": "../Data/images/Brewed/BRW3.jpg",
      "category": "singleOriginCoffee"
    },
    {
      "id": "SNG04",
      "name": "Guatemala Antigua",
      "price": 9.49,
      "rating": 4.7,
      "image": "../Data/images/espresso/epresso1.jpg",
      "category": "singleOriginCoffee"
    },
    {
      "id": "SNG05",
      "name": "Kenya AA",
      "price": 9.99,
      "rating": 4.8,
      "image": "../Data/images/Brewed/BRW5.jpg",
      "category": "singleOriginCoffee"
    },

    {
      "id": "SNG06",
      "name": "Sumatra Mandheling",
      "price": 10.49,
      "rating": 4.5,
      "image": "../Data/images/Brewed/BRW3.jpg",
      "category": "singleOriginCoffee"
    }
  ],

  "blogposts": [
    {
      "date": "2022-01-01",
      "name": "John Smith",
      "title": "Why New Year's Resolutions Fail",
      "article": "New Year's resolutions are a popular way to start off the year on a positive note, but why do so many people fail to stick to them? The truth is that most resolutions are too vague or unrealistic to be sustainable. Instead of setting broad goals like 'lose weight' or 'save money,' try breaking them down into smaller, achievable steps. For example, set a goal to exercise for 30 minutes a day or save $50 a week. Additionally, it's important to be kind to yourself and acknowledge that slip-ups are normal. Don't beat yourself up if you miss a day of exercise or spend more than you planned. Remember, the goal is progress, not perfection."
    },
    {
      "date": "2022-02-14",
      "name": "Jane Doe",
      "title": "The Benefits of Practicing Self-Care",
      "article": "Self-care has become a buzzword in recent years, but what does it really mean? Simply put, self-care is any activity that we do to take care of our physical, mental, and emotional well-being. Some examples of self-care include exercise, meditation, getting enough sleep, and spending time with loved ones. Practicing self-care has numerous benefits, including reduced stress levels, improved mood, and increased productivity. When we take care of ourselves, we're better equipped to handle the challenges that life throws our way. So, make sure to carve out time in your schedule for self-care activities and prioritize your well-being."
    },
    {
      "date": "2022-03-17",
      "name": "David Lee",
      "title": "The Benefits of Volunteering",
      "article": "Volunteering is a great way to give back to your community while also improving your own well-being. Studies have shown that people who volunteer on a regular basis have lower levels of stress and depression, and may even live longer than those who don't volunteer. Volunteering can also help you build new skills, meet new people, and gain a sense of purpose. Whether you're interested in helping out at a local food bank, tutoring children, or volunteering at a community event, there are countless opportunities to make a difference. So, why not give volunteering a try and see how it can benefit you and your community?"
    },
    {
      "date": "2022-04-22",
      "name": "Sarah Williams",
      "title": "The Importance of Good Sleep Habits",
      "article": "Getting enough sleep is essential for our overall health and well-being. Not only does it help us feel more alert and focused during the day, but it also plays a critical role in maintaining a healthy immune system, managing stress, and regulating our mood. To get the most out of your sleep, it's important to establish good sleep habits. This includes creating a relaxing bedtime routine, avoiding caffeine and alcohol before bedtime, and creating a comfortable sleep environment. Additionally, try to stick to a consistent sleep schedule, even on the weekends. With a little effort and consistency, you can improve your sleep habits and reap the many benefits of a good night's sleep."
    },
    {
      "date": "2022-01-01",
      "name": "temitope david",
      "title": "The Benefits of Meditation",
      "article": "Meditation is a practice that has been around for thousands of years and has been shown to have numerous benefits for both the mind and body. Studies have shown that regular meditation can reduce stress, lower blood pressure, improve focus and concentration, and even improve sleep quality.\n\nOne of the great things about meditation is that it can be practiced by anyone, regardless of age or physical ability. It doesn't require any special equipment or training, and it can be done just about anywhere.\n\nIf you're new to meditation, it can be helpful to start with short sessions of just a few minutes each day. As you become more comfortable with the practice, you can gradually increase the length of your sessions.\n\nThere are many different types of meditation, so it's important to find the one that works best for you. Some popular types of meditation include mindfulness meditation, loving-kindness meditation, and transcendental meditation.\n\nOverall, the benefits of meditation are clear. If you're looking to improve your mental and physical health, give meditation a try!"
    },
    {
      "date": "2022-02-01",
      "name": "Emily Jones",
      "title": "The Importance of Self-Care",
      "article": "Self-care is an important part of maintaining good mental and physical health. It involves taking time for yourself to do things that make you feel good and reduce stress.\n\nSelf-care can take many forms, from taking a bubble bath to going for a walk in nature. The important thing is to find activities that help you relax and recharge.\n\nIn our busy lives, it can be easy to neglect self-care in favor of work or other obligations. However, it's important to remember that taking care of yourself is not selfish – it's necessary for your well-being.\n\nIf you're not sure where to start with self-care, try making a list of things that make you happy and relaxed. Then, try to incorporate one or two of these activities into your daily routine.\n\nRemember, self-care is not a one-time event – it's an ongoing practice. Make it a priority in your life and you'll reap the benefits for years to come."
    },
    {
      "date": "2022-03-01",
      "name": "David Chen",
      "title": "How to Stay Productive While Working from Home",
      "article": "Working from home has become increasingly common in recent years, but it can be a challenge to stay productive in a home environment. Here are some tips to help you stay on track:\n\n1. Set up a dedicated workspace: Create a designated area for work that is free from distractions.\n\n2. Stick to a routine: Try to maintain a regular work schedule, including breaks and lunchtime.\n\n3. Take breaks: Take regular breaks throughout the day to stretch your legs, rest your eyes, and recharge.\n\n4. Minimize distractions: Turn off notifications on your phone and computer, and close unnecessary tabs and applications.\n\n5. Stay connected: Make an effort to stay in touch with colleagues, either through video conferencing or messaging apps.\n\nBy implementing these tips, you can create a productive and fulfilling work-from-home experience."
    },
    {
      "date": "2023-04-27",
      "name": "John Doe",
      "title": "The Benefits of Coffee",
      "article": "Coffee is one of the most popular beverages in the world, and for good reason. Not only does it taste great, but it also has many health benefits. Here are just a few reasons why you should consider adding coffee to your daily routine:\n\n1. Coffee can improve brain function and help you stay alert. The caffeine in coffee blocks the neurotransmitter adenosine, which makes you feel sleepy.\n\n2. Coffee is packed with antioxidants, which can help prevent cell damage and reduce the risk of chronic diseases like cancer and heart disease.\n\n3. Drinking coffee can also boost your metabolism and help you burn fat.\n\n4. Studies have shown that coffee may reduce the risk of developing type 2 diabetes and Alzheimer's disease.\n\n5. Coffee can also improve your mood and make you feel happier. The caffeine in coffee can stimulate the production of dopamine, which is a neurotransmitter that is associated with pleasure.\n\nSo if you're looking for a way to improve your health and feel great, consider adding coffee to your daily routine!"
    },
    {
      "date": "2023-04-26",
      "name": "Jane Smith",
      "title": "5 Tips for Brewing the Perfect Cup of Coffee",
      "article": "Brewing a great cup of coffee takes more than just throwing some grounds in a pot and hitting the brew button. Here are five tips for brewing the perfect cup of coffee:\n\n1. Use high-quality, freshly roasted coffee beans. The quality of your coffee beans will have a huge impact on the taste of your coffee.\n\n2. Grind your coffee beans just before brewing. Freshly ground coffee will have a more intense flavor and aroma.\n\n3. Use the right amount of coffee grounds. The general rule of thumb is to use 1 to 2 tablespoons of coffee grounds for every 6 ounces of water.\n\n4. Brew your coffee at the right temperature. The optimal temperature for brewing coffee is between 195°F and 205°F.\n\n5. Use a clean coffee maker. A dirty coffee maker can leave residue and affect the taste of your coffee.\n\nBy following these tips, you can brew a delicious cup of coffee that will satisfy even the most discerning coffee connoisseur."
    },
    {
      "date": "2023-04-27",
      "name": "John Doe",
      "title": "The Art of Brewing Coffee",
      "article": "Brewing coffee is both a science and an art. It requires precise measurements, temperatures, and timing, but also allows for personal preferences and creativity.\n\nTo start, choose your brewing method. There are many options, including drip, pour-over, French press, and espresso. Each method has its own unique characteristics and can produce different flavor profiles.\n\nNext, select your beans. Coffee beans can vary greatly in flavor depending on their origin, roast level, and processing method. Experiment with different varieties to find your preferred taste.\n\nWhen brewing, be sure to measure your coffee and water carefully. Use a scale and follow the recommended ratios for your brewing method. Water temperature is also important, as it can affect the extraction and flavor of the coffee.\n\nFinally, don't be afraid to experiment and personalize your brew. Add a splash of milk, a sprinkle of cinnamon, or a dollop of whipped cream to make your coffee truly your own.\n\nWith a little practice and experimentation, you can become a master at brewing coffee and enjoy a delicious cup every morning."
    },
    {
      "date": "2023-04-26",
      "name": "Jane Smith",
      "title": "The Health Benefits of Coffee",
      "article": "Coffee has been shown to have numerous health benefits, including improved cognitive function, increased energy, and a reduced risk of certain diseases.\n\nThe caffeine in coffee can enhance mental alertness and improve focus and concentration. It can also boost physical performance by increasing endurance and reducing fatigue.\n\nIn addition to its mental and physical benefits, coffee has been linked to a reduced risk of several diseases, including type 2 diabetes, Parkinson's disease, and liver cancer. It may also lower the risk of stroke and heart disease.\n\nHowever, it's important to consume coffee in moderation and be mindful of any negative side effects, such as increased anxiety or disrupted sleep. If you have a sensitivity to caffeine or a medical condition that may be affected by coffee consumption, it's best to consult with your doctor before making it a regular part of your diet.\n\nOverall, coffee can be a healthy and enjoyable addition to your daily routine when consumed in moderation and with awareness of your own health needs."
    },
    {
      "date": "2023-04-25",
      "name": "Bob Johnson",
      "title": "The History of Coffee",
      "article": "Coffee has a rich and fascinating history that spans over a thousand years. The origins of coffee can be traced back to Ethiopia, where legend has it that a goat herder named Kaldi discovered the stimulating effects of the coffee plant.Coffee was first cultivated in Arabia in the 15th century and quickly spread throughout the Middle East. It became a popular drink in coffee houses, which were hubs of social and political activity.\n\nIn the 17th century, coffee was introduced to Europe and became a symbol of wealth and sophistication. It was also brought to the Americas, where it played a key role in the development of colonial economies.\n\nToday, coffee is one of the most widely consumed beverages in the world. It has evolved into a global industry that includes cultivation, roasting, brewing, and consumption. Whether enjoyed in a traditional Turkish coffee house, a modern café, or at home, coffee continues to be a beloved and culturally significant drink."
    }
  ]
}
